//#include<iostream>
//using namespace std;
//
//
////int main() {		//通过指针变量访问整形变量
////	int a, b;
////	int* p1, * p2;
////	a = 100;
////	b = 10;
////	p1 = &a;			//把变量a的地址赋给p1
////	p2 = &b;
////	cout << a << " " << b << endl;
////	cout << *p1 << " " << *p2 << endl;		//*p为指针变量p所指向的存储单元		可以这样理解: *p1就是变量a，&*p1等价与&a  & *为等优先级符号 从右往左方向结合
////	return 0;
////}
//
//int main() {		// 输入两个整数 按先大后小的顺序输出（用指针变量处理）
//	int* p1, * p2, * p, a, b;
//	cin >> a >> b;	
//	p1 = &a;
//	p2 = &b;
//	if (a < b) {
//		p = p1;
//		p1 = p2;
//		p2 = p;				//将p1的指向和p2的指向互换  也就是现在*p1是较大的变量b了  但是整形变量a b的值没有改变
//	}
//	cout << "a= " << a << "  " << "b= " << b << endl;
//	cout << "max= " << *p1 << "  " << "min= " << *p2 << endl;
//	return 0;
//}
//
